ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/FLASHCTL_1.0.xml
    <register id="FLASHCTL_CMDDATA3" width="32" offset="0x113C" description="Command Data Register Bits 127:96">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA4" width="32" offset="0x1140" description="Command Data Register 4">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field.
T" begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA5" width="32" offset="0x1144" description="Command Data Register 5">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA6" width="32" offset="0x1148" description="Command Data Register 6">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA7" width="32" offset="0x114C" description="Command Data Register 7">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA8" width="32" offset="0x1150" description="Command Data Register 8">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA9" width="32" offset="0x1154" description="Command Data Register 9">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA10" width="32" offset="0x1158" description="Command Data Register 10">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA11" width="32" offset="0x115C" description="Command Data Register 11">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA12" width="32" offset="0x1160" description="Command Data Register 12">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA13" width="32" offset="0x1164" description="Command Data Register 13">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA14" width="32" offset="0x1168" description="Command Data Register 14">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATA15" width="32" offset="0x116C" description="Command Data Register 15">
        <bitfield id="VAL" description="A 32-bit data value is placed in this field." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATAECC0" width="32" offset="0x11B0" description="Command Data Register ECC 0">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
