ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/FLASHCTL_1.0.xml
    <register id="FLASHCTL_CMDDATAECC1" width="32" offset="0x11B4" description="Command Data Register ECC 1">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATAECC2" width="32" offset="0x11B8" description="Command Data Register ECC 2">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDDATAECC3" width="32" offset="0x11BC" description="Command Data Register ECC 3">
        <bitfield id="VAL0" description="ECC data for bits 63:0 of the data is placed here." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="VAL1" description="ECC data for bits 127:64 of the data is placed here." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDWEPROTA" width="32" offset="0x11D0" description="Command Write Erase Protect A Register">
        <bitfield id="VAL" description="Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the flash memory will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the flash memory will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the flash memory will be protected from program
		and erase." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDWEPROTB" width="32" offset="0x11D4" description="Command Write Erase Protect B Register">
        <bitfield id="VAL" description="Each bit protects a group of 8 sectors.  When a bit is 1, the associated 8 sectors
in the flash will be protected from program and erase.  A maximum of 256
sectors can be protected with this register." begin="27" end="0" width="28" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDWEPROTNM" width="32" offset="0x1210" description="Command Write Erase Protect Non-Main Register">
        <bitfield id="VAL" description="Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the non-main region will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the non-main region will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the non-main will be protected from program
		and erase." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDWEPROTTR" width="32" offset="0x1214" description="Command Write Erase Protect Trim Register">
        <bitfield id="VAL" description="Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the engr region will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the engr region will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the engr region will be protected from program
		and erase." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CMDWEPROTEN" width="32" offset="0x1218" description="Command Write Erase Protect Engr Register">
        <bitfield id="VAL" description="Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the engr region will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the engr region will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the engr region will be protected from program
		and erase." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value of [VAL]"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum value of [VAL]"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CFGCMD" width="32" offset="0x13B0" description="Command Configuration Register">
        <bitfield id="WAITSTATE" description="Wait State setting for verify reads" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="FLASHCTL_CFGPCNT" width="32" offset="0x13B4" description="Pulse Counter Configuration Register">
        <bitfield id="MAXPCNTOVR" description="Override hard-wired maximum pulse count.  If MAXERSPCNTOVR
is not set, then setting this value alone will override the max pulse count for
both program and erase.  If MAXERSPCNTOVR is set, then this bit will only
control the max pulse count setting for program.
By default, this bit is 0, and a hard-wired max pulse count is used." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DEFAULT" value="0x0" description="Use hard-wired (default) value for maximum pulse count"/>
            <bitenum id="OVERRIDE" value="0x1" description="Use value from MAXPCNTVAL field as maximum puse count"/>
        </bitfield>
        <bitfield id="MAXPCNTVAL" description="Override maximum pulse counter with this value.
If MAXPCNTOVR = 0, then this field is ignored.
If MAXPCNTOVR = 1 and MAXERSPCNTOVR = 0, then this value will be used
to override the max pulse count for both program and erase.  Full max value
will be {4'h0, MAXPCNTVAL} .
If MAXPCNTOVR = 1 and MAXERSPCNTOVR = 1, then this value will be used
to override the max pulse count for program only.  Full max value will be
{4'h0, MAXPCNTVAL}." begin="11" end="4" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum value"/>
        </bitfield>
        <bitfield id="MAXERSPCNTOVR" description="Override hard-wired maximum pulse count for erase.  If set, then the value
in MAXERSPCNTVAL will be used as the max pulse count for erase operations.
By default, this bit is 0, and a hard-wired max pulse count is used." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DEFAULT" value="0x0" description="Use hard-wired (default) value for maximum pulse count"/>
            <bitenum id="OVERRIDE" value="0x1" description="Use value from MAXERSPCNTVAL field as maximum erase pulse count"/>
        </bitfield>
        <bitfield id="MAXERSPCNTVAL" description="Override maximum pulse count for erase with this value.
If MAXERSPCNTOVR = 0, then this field is ignored.
If MAXERSPCNTOVR = 1, then this value will be used
to override the max pulse count for erase." begin="31" end="20" width="12" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFFF" description="Maximum value"/>
        </bitfield>
    </register>
